Estadio-do-Dragao-app/STM32N6-GettingStarted-ObjectDetection/Application/STM32N6570-DK/Src/main.c
    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    uint32_t ts[2] = { 0 };

#if DCMIPP_NN_NEEDS_CROP
    /*
     * Crop the image: the DCMIPP hardware requires output dimensions to be
     * multiples of 16, so we crop the padded buffer into the NN input buffer.
     */
    SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    hwc_u8_to_chw_s8(dcmipp_out_nn, pitch_nn, (int8_t *)nn_in,
                     STAI_NETWORK_IN_1_WIDTH, STAI_NETWORK_IN_1_HEIGHT, STAI_NETWORK_IN_1_CHANNEL);
    SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
#endif

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    ret = stai_network_run(network_context, STAI_MODE_SYNC);
    assert(ret == 0);
    ts[1] = HAL_GetTick();

    g_det_count = ssd_post_process((const int8_t *)nn_out[0], (const int8_t *)nn_out[1],
                                    lcd_bg_area.XSize, lcd_bg_area.YSize,
                                    g_dets, APP_SSDLITE_MAX_DETS);
    g_grid_count = ssd_build_grid_from_dets(g_dets, g_det_count, g_grid, APP_GRID_MAX_POINTS);
    const uint32_t inference_ms = ts[1] - ts[0];
    const float avg_confidence = Compute_Avg_Confidence(g_dets, g_det_count);
    const float current_fps = (inference_ms > 0U) ? (1000.0f / (float)inference_ms) : 0.0f;

    if (g_frame_count == 0U) {
      g_ema_inference_ms = (float)inference_ms;
      g_ema_fps = current_fps;
    } else {
      g_ema_inference_ms = (0.90f * g_ema_inference_ms) + (0.10f * (float)inference_ms);
      g_ema_fps = (0.90f * g_ema_fps) + (0.10f * current_fps);
    }
    g_frame_count++;

    if ((g_frame_count % 30U) == 0U) {
      printf("METRICS:{\"frame\":%lu,\"det_count\":%lu,\"inf_ms\":%lu,\"fps\":%.2f,\"ema_inf_ms\":%.2f,\"ema_fps\":%.2f,\"avg_conf\":%.3f}\r\n",
             (unsigned long)g_frame_count,
             (unsigned long)g_det_count,
             (unsigned long)inference_ms,
             (double)current_fps,
             (double)g_ema_inference_ms,
             (double)g_ema_fps,
             (double)avg_confidence);
    }

    mqtt_pub_crowd_density(g_det_count, g_grid, g_grid_count, inference_ms, avg_confidence);

    Display_NetworkOutput(g_det_count, g_dets, inference_ms);
    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      void *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }
  }
}

static float Compute_Avg_Confidence(const ssd_det_t *dets, uint32_t det_count)
{
  if (!dets || det_count == 0U) {
    return 0.0f;
  }

  float sum = 0.0f;
  for (uint32_t i = 0; i < det_count; i++) {
    sum += dets[i].score;
  }
  return sum / (float)det_count;
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();

  NPURam_enable();

  Fuse_Programming();

  NPUCache_config();

  /*** External RAM and NOR Flash *********************************************/
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);

  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

}

static void NeuralNetwork_init(uint32_t *nn_in_length, stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[])
{
  stai_network_info info;
  int ret;

  /* initialize runtime */
  ret = stai_runtime_init();
  assert(ret == STAI_SUCCESS);
  /* init model instance */
  ret = stai_network_init(network_context);
  assert(ret == STAI_SUCCESS);

  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  assert(info.n_inputs == 1);
  *number_output = STAI_NETWORK_OUT_NUM;

  /* Get the input buffer size & address */
  *nn_in_length = info.inputs[0].size_bytes;
  ret = stai_network_get_inputs(network_context, &nn_in, (stai_size *)&info.n_inputs);
  assert(ret == STAI_SUCCESS);

  /* Get the output buffers size & address */
  ret = stai_network_get_outputs(network_context, nn_out, number_output);
  assert(ret == STAI_SUCCESS);
  for (int i = 0; i < *number_output; i++)
  {
    nn_out_len[i] = info.outputs[i].size_bytes;
  }
}

/**
 * @brief Convert uint8 HWC image to int8 CHW format required by the SSD model.
 *        DCMIPP outputs RGB888 in HWC layout (stride may include padding).
 *        The model expects int8 CHW with values = uint8 - 128.
 */
static void hwc_u8_to_chw_s8(const uint8_t *hwc_src, uint32_t stride,
                               int8_t *chw_dst, uint32_t w, uint32_t h, uint32_t c)
{
  uint32_t plane = w * h;
  for (uint32_t row = 0; row < h; row++)
  {
    const uint8_t *src_row = hwc_src + row * stride;
    for (uint32_t col = 0; col < w; col++)
    {
      for (uint32_t ch = 0; ch < c; ch++)
      {
        chw_dst[ch * plane + row * w + col] = (int8_t)(src_row[col * c + ch] - 128u);
      }
    }
  }
}

static void NPURam_enable(void)
{
  __HAL_RCC_NPU_CLK_ENABLE();
  __HAL_RCC_NPU_FORCE_RESET();
  __HAL_RCC_NPU_RELEASE_RESET();

  /* Enable NPU RAMs (4x448KB) */
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM5_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

static void set_clk_sleep_mode(void)
{
  /*** Enable sleep mode support during NPU inference *************************/
  /* Configure peripheral clocks to remain active during sleep mode */
  /* Keep all IP's enabled during WFE so they can wake up CPU. Fine tune
   * this if you want to save maximum power
   */
  __HAL_RCC_XSPI1_CLK_SLEEP_ENABLE();    /* For display frame buffer */
  __HAL_RCC_XSPI2_CLK_SLEEP_ENABLE();    /* For NN weights */
  __HAL_RCC_NPU_CLK_SLEEP_ENABLE();      /* For NN inference */
  __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE(); /* For NN inference */
  __HAL_RCC_LTDC_CLK_SLEEP_ENABLE();     /* For display */
  __HAL_RCC_DMA2D_CLK_SLEEP_ENABLE();    /* For display */
  __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE();   /* For camera configuration retention */
  __HAL_RCC_CSI_CLK_SLEEP_ENABLE();      /* For camera configuration retention */

  __HAL_RCC_FLEXRAM_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE(); 

